mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gmxh/common/s6e2gmxh.h
#define FM4_ETHERNET_MAC0_RXUDP_ERR_FRMS          *((volatile uint32_t*)(0x40064234UL))
#define FM_ETHERNET_MAC0_RXTCP_GD_FRMS            *((volatile uint32_t*)(0x40064238UL))
#define FM4_ETHERNET_MAC0_RXTCP_GD_FRMS           *((volatile uint32_t*)(0x40064238UL))
#define FM_ETHERNET_MAC0_RXTCP_ERR_FRMS           *((volatile uint32_t*)(0x4006423CUL))
#define FM4_ETHERNET_MAC0_RXTCP_ERR_FRMS          *((volatile uint32_t*)(0x4006423CUL))
#define FM_ETHERNET_MAC0_RXICMP_GD_FRMS           *((volatile uint32_t*)(0x40064240UL))
#define FM4_ETHERNET_MAC0_RXICMP_GD_FRMS          *((volatile uint32_t*)(0x40064240UL))
#define FM_ETHERNET_MAC0_RXICMP_ERR_FRMS          *((volatile uint32_t*)(0x40064244UL))
#define FM4_ETHERNET_MAC0_RXICMP_ERR_FRMS         *((volatile uint32_t*)(0x40064244UL))
#define FM_ETHERNET_MAC0_RXIPV4_GD_OCTETS         *((volatile uint32_t*)(0x40064250UL))
#define FM4_ETHERNET_MAC0_RXIPV4_GD_OCTETS        *((volatile uint32_t*)(0x40064250UL))
#define FM_ETHERNET_MAC0_RXIPV4_HDRERR_OCTETS     *((volatile uint32_t*)(0x40064254UL))
#define FM4_ETHERNET_MAC0_RXIPV4_HDRERR_OCTETS    *((volatile uint32_t*)(0x40064254UL))
#define FM_ETHERNET_MAC0_RXIPV4_NOPAY_OCTETS      *((volatile uint32_t*)(0x40064258UL))
#define FM4_ETHERNET_MAC0_RXIPV4_NOPAY_OCTETS     *((volatile uint32_t*)(0x40064258UL))
#define FM_ETHERNET_MAC0_RXIPV4_FRAG_OCTETS       *((volatile uint32_t*)(0x4006425CUL))
#define FM4_ETHERNET_MAC0_RXIPV4_FRAG_OCTETS      *((volatile uint32_t*)(0x4006425CUL))
#define FM_ETHERNET_MAC0_RXIPV4_UDSBL_OCTETS      *((volatile uint32_t*)(0x40064260UL))
#define FM4_ETHERNET_MAC0_RXIPV4_UDSBL_OCTETS     *((volatile uint32_t*)(0x40064260UL))
#define FM_ETHERNET_MAC0_RXIPV6_GD_OCTETS         *((volatile uint32_t*)(0x40064264UL))
#define FM4_ETHERNET_MAC0_RXIPV6_GD_OCTETS        *((volatile uint32_t*)(0x40064264UL))
#define FM_ETHERNET_MAC0_RXIPV6_HDRERR_OCTETS     *((volatile uint32_t*)(0x40064268UL))
#define FM4_ETHERNET_MAC0_RXIPV6_HDRERR_OCTETS    *((volatile uint32_t*)(0x40064268UL))
#define FM_ETHERNET_MAC0_RXIPV6_NOPAY_OCTETS      *((volatile uint32_t*)(0x4006426CUL))
#define FM4_ETHERNET_MAC0_RXIPV6_NOPAY_OCTETS     *((volatile uint32_t*)(0x4006426CUL))
#define FM_ETHERNET_MAC0_RXUDP_GD_OCTETS          *((volatile uint32_t*)(0x40064270UL))
#define FM4_ETHERNET_MAC0_RXUDP_GD_OCTETS         *((volatile uint32_t*)(0x40064270UL))
#define FM_ETHERNET_MAC0_RXUDP_ERR_OCTETS         *((volatile uint32_t*)(0x40064274UL))
#define FM4_ETHERNET_MAC0_RXUDP_ERR_OCTETS        *((volatile uint32_t*)(0x40064274UL))
#define FM_ETHERNET_MAC0_RXTCP_GD_OCTETS          *((volatile uint32_t*)(0x40064278UL))
#define FM4_ETHERNET_MAC0_RXTCP_GD_OCTETS         *((volatile uint32_t*)(0x40064278UL))
#define FM_ETHERNET_MAC0_RXTCP_ERR_OCTETS         *((volatile uint32_t*)(0x4006427CUL))
#define FM4_ETHERNET_MAC0_RXTCP_ERR_OCTETS        *((volatile uint32_t*)(0x4006427CUL))
#define FM_ETHERNET_MAC0_RXICMP_GD_OCTETS         *((volatile uint32_t*)(0x40064280UL))
#define FM4_ETHERNET_MAC0_RXICMP_GD_OCTETS        *((volatile uint32_t*)(0x40064280UL))
#define FM_ETHERNET_MAC0_RXICMP_ERR_OCTETS        *((volatile uint32_t*)(0x40064284UL))
#define FM4_ETHERNET_MAC0_RXICMP_ERR_OCTETS       *((volatile uint32_t*)(0x40064284UL))
#define FM_ETHERNET_MAC0_TSCR                     *((volatile uint32_t*)(0x40064700UL))
#define FM4_ETHERNET_MAC0_TSCR                    *((volatile uint32_t*)(0x40064700UL))
#define FM_ETHERNET_MAC0_SSIR                     *((volatile uint32_t*)(0x40064704UL))
#define FM4_ETHERNET_MAC0_SSIR                    *((volatile uint32_t*)(0x40064704UL))
#define FM_ETHERNET_MAC0_STSR                     *((volatile uint32_t*)(0x40064708UL))
#define FM4_ETHERNET_MAC0_STSR                    *((volatile uint32_t*)(0x40064708UL))
#define FM_ETHERNET_MAC0_STNR                     *((volatile uint32_t*)(0x4006470CUL))
#define FM4_ETHERNET_MAC0_STNR                    *((volatile uint32_t*)(0x4006470CUL))
#define FM_ETHERNET_MAC0_STSUR                    *((volatile uint32_t*)(0x40064710UL))
#define FM4_ETHERNET_MAC0_STSUR                   *((volatile uint32_t*)(0x40064710UL))
#define FM_ETHERNET_MAC0_STNUR                    *((volatile uint32_t*)(0x40064714UL))
#define FM4_ETHERNET_MAC0_STNUR                   *((volatile uint32_t*)(0x40064714UL))
#define FM_ETHERNET_MAC0_TSAR                     *((volatile uint32_t*)(0x40064718UL))
#define FM4_ETHERNET_MAC0_TSAR                    *((volatile uint32_t*)(0x40064718UL))
#define FM_ETHERNET_MAC0_TTSR                     *((volatile uint32_t*)(0x4006471CUL))
#define FM4_ETHERNET_MAC0_TTSR                    *((volatile uint32_t*)(0x4006471CUL))
#define FM_ETHERNET_MAC0_TTNR                     *((volatile uint32_t*)(0x40064720UL))
#define FM4_ETHERNET_MAC0_TTNR                    *((volatile uint32_t*)(0x40064720UL))
#define FM_ETHERNET_MAC0_STHWSR                   *((volatile uint32_t*)(0x40064724UL))
#define FM4_ETHERNET_MAC0_STHWSR                  *((volatile uint32_t*)(0x40064724UL))
#define FM_ETHERNET_MAC0_TSR                      *((volatile uint32_t*)(0x40064728UL))
#define FM4_ETHERNET_MAC0_TSR                     *((volatile uint32_t*)(0x40064728UL))
#define FM_ETHERNET_MAC0_PPSCR                    *((volatile uint32_t*)(0x4006472CUL))
#define FM4_ETHERNET_MAC0_PPSCR                   *((volatile uint32_t*)(0x4006472CUL))
#define FM_ETHERNET_MAC0_ATNR                     *((volatile uint32_t*)(0x40064730UL))
#define FM4_ETHERNET_MAC0_ATNR                    *((volatile uint32_t*)(0x40064730UL))
#define FM_ETHERNET_MAC0_ATSR                     *((volatile uint32_t*)(0x40064734UL))
#define FM4_ETHERNET_MAC0_ATSR                    *((volatile uint32_t*)(0x40064734UL))
#define FM_ETHERNET_MAC0_MAR16H                   *((volatile uint32_t*)(0x40064800UL))
#define FM4_ETHERNET_MAC0_MAR16H                  *((volatile uint32_t*)(0x40064800UL))
#define FM_ETHERNET_MAC0_MAR16L                   *((volatile uint32_t*)(0x40064804UL))
#define FM4_ETHERNET_MAC0_MAR16L                  *((volatile uint32_t*)(0x40064804UL))
#define FM_ETHERNET_MAC0_MAR17H                   *((volatile uint32_t*)(0x40064808UL))
#define FM4_ETHERNET_MAC0_MAR17H                  *((volatile uint32_t*)(0x40064808UL))
#define FM_ETHERNET_MAC0_MAR17L                   *((volatile uint32_t*)(0x4006480CUL))
#define FM4_ETHERNET_MAC0_MAR17L                  *((volatile uint32_t*)(0x4006480CUL))
#define FM_ETHERNET_MAC0_MAR18H                   *((volatile uint32_t*)(0x40064810UL))
#define FM4_ETHERNET_MAC0_MAR18H                  *((volatile uint32_t*)(0x40064810UL))
#define FM_ETHERNET_MAC0_MAR18L                   *((volatile uint32_t*)(0x40064814UL))
#define FM4_ETHERNET_MAC0_MAR18L                  *((volatile uint32_t*)(0x40064814UL))
#define FM_ETHERNET_MAC0_MAR19H                   *((volatile uint32_t*)(0x40064818UL))
#define FM4_ETHERNET_MAC0_MAR19H                  *((volatile uint32_t*)(0x40064818UL))
#define FM_ETHERNET_MAC0_MAR19L                   *((volatile uint32_t*)(0x4006481CUL))
#define FM4_ETHERNET_MAC0_MAR19L                  *((volatile uint32_t*)(0x4006481CUL))
#define FM_ETHERNET_MAC0_MAR20H                   *((volatile uint32_t*)(0x40064820UL))
#define FM4_ETHERNET_MAC0_MAR20H                  *((volatile uint32_t*)(0x40064820UL))
#define FM_ETHERNET_MAC0_MAR20L                   *((volatile uint32_t*)(0x40064824UL))
#define FM4_ETHERNET_MAC0_MAR20L                  *((volatile uint32_t*)(0x40064824UL))
#define FM_ETHERNET_MAC0_MAR21H                   *((volatile uint32_t*)(0x40064828UL))
#define FM4_ETHERNET_MAC0_MAR21H                  *((volatile uint32_t*)(0x40064828UL))
#define FM_ETHERNET_MAC0_MAR21L                   *((volatile uint32_t*)(0x4006482CUL))
#define FM4_ETHERNET_MAC0_MAR21L                  *((volatile uint32_t*)(0x4006482CUL))
#define FM_ETHERNET_MAC0_MAR22H                   *((volatile uint32_t*)(0x40064830UL))
#define FM4_ETHERNET_MAC0_MAR22H                  *((volatile uint32_t*)(0x40064830UL))
#define FM_ETHERNET_MAC0_MAR22L                   *((volatile uint32_t*)(0x40064834UL))
#define FM4_ETHERNET_MAC0_MAR22L                  *((volatile uint32_t*)(0x40064834UL))
#define FM_ETHERNET_MAC0_MAR23H                   *((volatile uint32_t*)(0x40064838UL))
#define FM4_ETHERNET_MAC0_MAR23H                  *((volatile uint32_t*)(0x40064838UL))
#define FM_ETHERNET_MAC0_MAR23L                   *((volatile uint32_t*)(0x4006483CUL))
#define FM4_ETHERNET_MAC0_MAR23L                  *((volatile uint32_t*)(0x4006483CUL))
#define FM_ETHERNET_MAC0_MAR24H                   *((volatile uint32_t*)(0x40064840UL))
#define FM4_ETHERNET_MAC0_MAR24H                  *((volatile uint32_t*)(0x40064840UL))
#define FM_ETHERNET_MAC0_MAR24L                   *((volatile uint32_t*)(0x40064844UL))
#define FM4_ETHERNET_MAC0_MAR24L                  *((volatile uint32_t*)(0x40064844UL))
#define FM_ETHERNET_MAC0_MAR25H                   *((volatile uint32_t*)(0x40064848UL))
#define FM4_ETHERNET_MAC0_MAR25H                  *((volatile uint32_t*)(0x40064848UL))
#define FM_ETHERNET_MAC0_MAR25L                   *((volatile uint32_t*)(0x4006484CUL))
#define FM4_ETHERNET_MAC0_MAR25L                  *((volatile uint32_t*)(0x4006484CUL))
#define FM_ETHERNET_MAC0_MAR26H                   *((volatile uint32_t*)(0x40064850UL))
#define FM4_ETHERNET_MAC0_MAR26H                  *((volatile uint32_t*)(0x40064850UL))
#define FM_ETHERNET_MAC0_MAR26L                   *((volatile uint32_t*)(0x40064854UL))
#define FM4_ETHERNET_MAC0_MAR26L                  *((volatile uint32_t*)(0x40064854UL))
#define FM_ETHERNET_MAC0_MAR27H                   *((volatile uint32_t*)(0x40064858UL))
#define FM4_ETHERNET_MAC0_MAR27H                  *((volatile uint32_t*)(0x40064858UL))
#define FM_ETHERNET_MAC0_MAR27L                   *((volatile uint32_t*)(0x4006485CUL))
#define FM4_ETHERNET_MAC0_MAR27L                  *((volatile uint32_t*)(0x4006485CUL))
#define FM_ETHERNET_MAC0_MAR28H                   *((volatile uint32_t*)(0x40064860UL))
#define FM4_ETHERNET_MAC0_MAR28H                  *((volatile uint32_t*)(0x40064860UL))
#define FM_ETHERNET_MAC0_MAR28L                   *((volatile uint32_t*)(0x40064864UL))
#define FM4_ETHERNET_MAC0_MAR28L                  *((volatile uint32_t*)(0x40064864UL))
#define FM_ETHERNET_MAC0_MAR29H                   *((volatile uint32_t*)(0x40064868UL))
#define FM4_ETHERNET_MAC0_MAR29H                  *((volatile uint32_t*)(0x40064868UL))
#define FM_ETHERNET_MAC0_MAR29L                   *((volatile uint32_t*)(0x4006486CUL))
#define FM4_ETHERNET_MAC0_MAR29L                  *((volatile uint32_t*)(0x4006486CUL))
#define FM_ETHERNET_MAC0_MAR30H                   *((volatile uint32_t*)(0x40064870UL))
#define FM4_ETHERNET_MAC0_MAR30H                  *((volatile uint32_t*)(0x40064870UL))
#define FM_ETHERNET_MAC0_MAR30L                   *((volatile uint32_t*)(0x40064874UL))
#define FM4_ETHERNET_MAC0_MAR30L                  *((volatile uint32_t*)(0x40064874UL))
#define FM_ETHERNET_MAC0_MAR31H                   *((volatile uint32_t*)(0x40064878UL))
#define FM4_ETHERNET_MAC0_MAR31H                  *((volatile uint32_t*)(0x40064878UL))
#define FM_ETHERNET_MAC0_MAR31L                   *((volatile uint32_t*)(0x4006487CUL))
#define FM4_ETHERNET_MAC0_MAR31L                  *((volatile uint32_t*)(0x4006487CUL))
#define FM_ETHERNET_MAC0_BMR                      *((volatile uint32_t*)(0x40065000UL))
#define FM4_ETHERNET_MAC0_BMR                     *((volatile uint32_t*)(0x40065000UL))
#define FM_ETHERNET_MAC0_TPDR                     *((volatile uint32_t*)(0x40065004UL))
#define FM4_ETHERNET_MAC0_TPDR                    *((volatile uint32_t*)(0x40065004UL))
#define FM_ETHERNET_MAC0_RPDR                     *((volatile uint32_t*)(0x40065008UL))
#define FM4_ETHERNET_MAC0_RPDR                    *((volatile uint32_t*)(0x40065008UL))
#define FM_ETHERNET_MAC0_RDLAR                    *((volatile uint32_t*)(0x4006500CUL))
#define FM4_ETHERNET_MAC0_RDLAR                   *((volatile uint32_t*)(0x4006500CUL))
#define FM_ETHERNET_MAC0_TDLAR                    *((volatile uint32_t*)(0x40065010UL))
#define FM4_ETHERNET_MAC0_TDLAR                   *((volatile uint32_t*)(0x40065010UL))
#define FM_ETHERNET_MAC0_SR                       *((volatile uint32_t*)(0x40065014UL))
#define FM4_ETHERNET_MAC0_SR                      *((volatile uint32_t*)(0x40065014UL))
#define FM_ETHERNET_MAC0_OMR                      *((volatile uint32_t*)(0x40065018UL))
#define FM4_ETHERNET_MAC0_OMR                     *((volatile uint32_t*)(0x40065018UL))
#define FM_ETHERNET_MAC0_IER                      *((volatile uint32_t*)(0x4006501CUL))
#define FM4_ETHERNET_MAC0_IER                     *((volatile uint32_t*)(0x4006501CUL))
#define FM_ETHERNET_MAC0_MFBOCR                   *((volatile uint32_t*)(0x40065020UL))
#define FM4_ETHERNET_MAC0_MFBOCR                  *((volatile uint32_t*)(0x40065020UL))
#define FM_ETHERNET_MAC0_RIWTR                    *((volatile uint32_t*)(0x40065024UL))
#define FM4_ETHERNET_MAC0_RIWTR                   *((volatile uint32_t*)(0x40065024UL))
#define FM_ETHERNET_MAC0_AHBSR                    *((volatile uint32_t*)(0x4006502CUL))
#define FM4_ETHERNET_MAC0_AHBSR                   *((volatile uint32_t*)(0x4006502CUL))
#define FM_ETHERNET_MAC0_CHTDR                    *((volatile uint32_t*)(0x40065048UL))
#define FM4_ETHERNET_MAC0_CHTDR                   *((volatile uint32_t*)(0x40065048UL))
#define FM_ETHERNET_MAC0_CHRDR                    *((volatile uint32_t*)(0x4006504CUL))
#define FM4_ETHERNET_MAC0_CHRDR                   *((volatile uint32_t*)(0x4006504CUL))
#define FM_ETHERNET_MAC0_CHTBAR                   *((volatile uint32_t*)(0x40065050UL))
#define FM4_ETHERNET_MAC0_CHTBAR                  *((volatile uint32_t*)(0x40065050UL))
#define FM_ETHERNET_MAC0_CHRBAR                   *((volatile uint32_t*)(0x40065054UL))
#define FM4_ETHERNET_MAC0_CHRBAR                  *((volatile uint32_t*)(0x40065054UL))

