mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gmxh/common/s6e2gmxh.h
#define bFM_CAN0_IF2CMSK_DATAB                    *((volatile  uint8_t *)(0x42C40840UL))
#define bFM4_CAN0_IF2CMSK_DATAB                   *((volatile  uint8_t *)(0x42C40840UL))
#define bFM_CAN0_IF2CMSK_DATAA                    *((volatile  uint8_t *)(0x42C40844UL))
#define bFM4_CAN0_IF2CMSK_DATAA                   *((volatile  uint8_t *)(0x42C40844UL))
#define bFM_CAN0_IF2CMSK_NEWDAT                   *((volatile  uint8_t *)(0x42C40848UL))
#define bFM4_CAN0_IF2CMSK_NEWDAT                  *((volatile  uint8_t *)(0x42C40848UL))
#define bFM_CAN0_IF2CMSK_CIP                      *((volatile  uint8_t *)(0x42C4084CUL))
#define bFM4_CAN0_IF2CMSK_CIP                     *((volatile  uint8_t *)(0x42C4084CUL))
#define bFM_CAN0_IF2CMSK_CONTROL                  *((volatile  uint8_t *)(0x42C40850UL))
#define bFM4_CAN0_IF2CMSK_CONTROL                 *((volatile  uint8_t *)(0x42C40850UL))
#define bFM_CAN0_IF2CMSK_ARB                      *((volatile  uint8_t *)(0x42C40854UL))
#define bFM4_CAN0_IF2CMSK_ARB                     *((volatile  uint8_t *)(0x42C40854UL))
#define bFM_CAN0_IF2CMSK_MASK                     *((volatile  uint8_t *)(0x42C40858UL))
#define bFM4_CAN0_IF2CMSK_MASK                    *((volatile  uint8_t *)(0x42C40858UL))
#define bFM_CAN0_IF2CMSK_WR_RD                    *((volatile  uint8_t *)(0x42C4085CUL))
#define bFM4_CAN0_IF2CMSK_WR_RD                   *((volatile  uint8_t *)(0x42C4085CUL))

#define bFM_CAN0_IF2CREQ_BUSY                     *((volatile  uint8_t *)(0x42C4083CUL))
#define bFM4_CAN0_IF2CREQ_BUSY                    *((volatile  uint8_t *)(0x42C4083CUL))

#define bFM_CAN0_IF2MCTR_EOB                      *((volatile  uint8_t *)(0x42C4099CUL))
#define bFM4_CAN0_IF2MCTR_EOB                     *((volatile  uint8_t *)(0x42C4099CUL))
#define bFM_CAN0_IF2MCTR_TXRQST                   *((volatile  uint8_t *)(0x42C409A0UL))
#define bFM4_CAN0_IF2MCTR_TXRQST                  *((volatile  uint8_t *)(0x42C409A0UL))
#define bFM_CAN0_IF2MCTR_RMTEN                    *((volatile  uint8_t *)(0x42C409A4UL))
#define bFM4_CAN0_IF2MCTR_RMTEN                   *((volatile  uint8_t *)(0x42C409A4UL))
#define bFM_CAN0_IF2MCTR_RXIE                     *((volatile  uint8_t *)(0x42C409A8UL))
#define bFM4_CAN0_IF2MCTR_RXIE                    *((volatile  uint8_t *)(0x42C409A8UL))
#define bFM_CAN0_IF2MCTR_TXIE                     *((volatile  uint8_t *)(0x42C409ACUL))
#define bFM4_CAN0_IF2MCTR_TXIE                    *((volatile  uint8_t *)(0x42C409ACUL))
#define bFM_CAN0_IF2MCTR_UMASK                    *((volatile  uint8_t *)(0x42C409B0UL))
#define bFM4_CAN0_IF2MCTR_UMASK                   *((volatile  uint8_t *)(0x42C409B0UL))
#define bFM_CAN0_IF2MCTR_INTPND                   *((volatile  uint8_t *)(0x42C409B4UL))
#define bFM4_CAN0_IF2MCTR_INTPND                  *((volatile  uint8_t *)(0x42C409B4UL))
#define bFM_CAN0_IF2MCTR_MSGLST                   *((volatile  uint8_t *)(0x42C409B8UL))
#define bFM4_CAN0_IF2MCTR_MSGLST                  *((volatile  uint8_t *)(0x42C409B8UL))
#define bFM_CAN0_IF2MCTR_NEWDAT                   *((volatile  uint8_t *)(0x42C409BCUL))
#define bFM4_CAN0_IF2MCTR_NEWDAT                  *((volatile  uint8_t *)(0x42C409BCUL))

#define bFM_CAN0_IF2MSK_MDIR                      *((volatile  uint8_t *)(0x42C408F8UL))
#define bFM4_CAN0_IF2MSK_MDIR                     *((volatile  uint8_t *)(0x42C408F8UL))
#define bFM_CAN0_IF2MSK_MXTD                      *((volatile  uint8_t *)(0x42C408FCUL))
#define bFM4_CAN0_IF2MSK_MXTD                     *((volatile  uint8_t *)(0x42C408FCUL))

#define bFM_CAN0_INTPND_INTPND1                   *((volatile  uint8_t *)(0x42C41400UL))
#define bFM4_CAN0_INTPND_INTPND1                  *((volatile  uint8_t *)(0x42C41400UL))
#define bFM_CAN0_INTPND_INTPND2                   *((volatile  uint8_t *)(0x42C41404UL))
#define bFM4_CAN0_INTPND_INTPND2                  *((volatile  uint8_t *)(0x42C41404UL))
#define bFM_CAN0_INTPND_INTPND3                   *((volatile  uint8_t *)(0x42C41408UL))
#define bFM4_CAN0_INTPND_INTPND3                  *((volatile  uint8_t *)(0x42C41408UL))
#define bFM_CAN0_INTPND_INTPND4                   *((volatile  uint8_t *)(0x42C4140CUL))
#define bFM4_CAN0_INTPND_INTPND4                  *((volatile  uint8_t *)(0x42C4140CUL))
#define bFM_CAN0_INTPND_INTPND5                   *((volatile  uint8_t *)(0x42C41410UL))
#define bFM4_CAN0_INTPND_INTPND5                  *((volatile  uint8_t *)(0x42C41410UL))
#define bFM_CAN0_INTPND_INTPND6                   *((volatile  uint8_t *)(0x42C41414UL))
#define bFM4_CAN0_INTPND_INTPND6                  *((volatile  uint8_t *)(0x42C41414UL))
#define bFM_CAN0_INTPND_INTPND7                   *((volatile  uint8_t *)(0x42C41418UL))
#define bFM4_CAN0_INTPND_INTPND7                  *((volatile  uint8_t *)(0x42C41418UL))
#define bFM_CAN0_INTPND_INTPND8                   *((volatile  uint8_t *)(0x42C4141CUL))
#define bFM4_CAN0_INTPND_INTPND8                  *((volatile  uint8_t *)(0x42C4141CUL))
#define bFM_CAN0_INTPND_INTPND9                   *((volatile  uint8_t *)(0x42C41420UL))
#define bFM4_CAN0_INTPND_INTPND9                  *((volatile  uint8_t *)(0x42C41420UL))
#define bFM_CAN0_INTPND_INTPND10                  *((volatile  uint8_t *)(0x42C41424UL))
#define bFM4_CAN0_INTPND_INTPND10                 *((volatile  uint8_t *)(0x42C41424UL))
#define bFM_CAN0_INTPND_INTPND11                  *((volatile  uint8_t *)(0x42C41428UL))
#define bFM4_CAN0_INTPND_INTPND11                 *((volatile  uint8_t *)(0x42C41428UL))
#define bFM_CAN0_INTPND_INTPND12                  *((volatile  uint8_t *)(0x42C4142CUL))
#define bFM4_CAN0_INTPND_INTPND12                 *((volatile  uint8_t *)(0x42C4142CUL))
#define bFM_CAN0_INTPND_INTPND13                  *((volatile  uint8_t *)(0x42C41430UL))
#define bFM4_CAN0_INTPND_INTPND13                 *((volatile  uint8_t *)(0x42C41430UL))
#define bFM_CAN0_INTPND_INTPND14                  *((volatile  uint8_t *)(0x42C41434UL))
#define bFM4_CAN0_INTPND_INTPND14                 *((volatile  uint8_t *)(0x42C41434UL))
#define bFM_CAN0_INTPND_INTPND15                  *((volatile  uint8_t *)(0x42C41438UL))
#define bFM4_CAN0_INTPND_INTPND15                 *((volatile  uint8_t *)(0x42C41438UL))
#define bFM_CAN0_INTPND_INTPND16                  *((volatile  uint8_t *)(0x42C4143CUL))
#define bFM4_CAN0_INTPND_INTPND16                 *((volatile  uint8_t *)(0x42C4143CUL))
#define bFM_CAN0_INTPND_INTPND17                  *((volatile  uint8_t *)(0x42C41440UL))
#define bFM4_CAN0_INTPND_INTPND17                 *((volatile  uint8_t *)(0x42C41440UL))
#define bFM_CAN0_INTPND_INTPND18                  *((volatile  uint8_t *)(0x42C41444UL))
#define bFM4_CAN0_INTPND_INTPND18                 *((volatile  uint8_t *)(0x42C41444UL))
#define bFM_CAN0_INTPND_INTPND19                  *((volatile  uint8_t *)(0x42C41448UL))
#define bFM4_CAN0_INTPND_INTPND19                 *((volatile  uint8_t *)(0x42C41448UL))
#define bFM_CAN0_INTPND_INTPND20                  *((volatile  uint8_t *)(0x42C4144CUL))
#define bFM4_CAN0_INTPND_INTPND20                 *((volatile  uint8_t *)(0x42C4144CUL))
#define bFM_CAN0_INTPND_INTPND21                  *((volatile  uint8_t *)(0x42C41450UL))
#define bFM4_CAN0_INTPND_INTPND21                 *((volatile  uint8_t *)(0x42C41450UL))
#define bFM_CAN0_INTPND_INTPND22                  *((volatile  uint8_t *)(0x42C41454UL))
#define bFM4_CAN0_INTPND_INTPND22                 *((volatile  uint8_t *)(0x42C41454UL))
#define bFM_CAN0_INTPND_INTPND23                  *((volatile  uint8_t *)(0x42C41458UL))
#define bFM4_CAN0_INTPND_INTPND23                 *((volatile  uint8_t *)(0x42C41458UL))
#define bFM_CAN0_INTPND_INTPND24                  *((volatile  uint8_t *)(0x42C4145CUL))
#define bFM4_CAN0_INTPND_INTPND24                 *((volatile  uint8_t *)(0x42C4145CUL))
#define bFM_CAN0_INTPND_INTPND25                  *((volatile  uint8_t *)(0x42C41460UL))
#define bFM4_CAN0_INTPND_INTPND25                 *((volatile  uint8_t *)(0x42C41460UL))
#define bFM_CAN0_INTPND_INTPND26                  *((volatile  uint8_t *)(0x42C41464UL))
#define bFM4_CAN0_INTPND_INTPND26                 *((volatile  uint8_t *)(0x42C41464UL))
#define bFM_CAN0_INTPND_INTPND27                  *((volatile  uint8_t *)(0x42C41468UL))
#define bFM4_CAN0_INTPND_INTPND27                 *((volatile  uint8_t *)(0x42C41468UL))
#define bFM_CAN0_INTPND_INTPND28                  *((volatile  uint8_t *)(0x42C4146CUL))
#define bFM4_CAN0_INTPND_INTPND28                 *((volatile  uint8_t *)(0x42C4146CUL))
#define bFM_CAN0_INTPND_INTPND29                  *((volatile  uint8_t *)(0x42C41470UL))
#define bFM4_CAN0_INTPND_INTPND29                 *((volatile  uint8_t *)(0x42C41470UL))
#define bFM_CAN0_INTPND_INTPND30                  *((volatile  uint8_t *)(0x42C41474UL))
#define bFM4_CAN0_INTPND_INTPND30                 *((volatile  uint8_t *)(0x42C41474UL))
#define bFM_CAN0_INTPND_INTPND31                  *((volatile  uint8_t *)(0x42C41478UL))
#define bFM4_CAN0_INTPND_INTPND31                 *((volatile  uint8_t *)(0x42C41478UL))
#define bFM_CAN0_INTPND_INTPND32                  *((volatile  uint8_t *)(0x42C4147CUL))
#define bFM4_CAN0_INTPND_INTPND32                 *((volatile  uint8_t *)(0x42C4147CUL))

#define bFM_CAN0_MSGVAL_MSGVAL1                   *((volatile  uint8_t *)(0x42C41600UL))
#define bFM4_CAN0_MSGVAL_MSGVAL1                  *((volatile  uint8_t *)(0x42C41600UL))
#define bFM_CAN0_MSGVAL_MSGVAL2                   *((volatile  uint8_t *)(0x42C41604UL))
#define bFM4_CAN0_MSGVAL_MSGVAL2                  *((volatile  uint8_t *)(0x42C41604UL))
#define bFM_CAN0_MSGVAL_MSGVAL3                   *((volatile  uint8_t *)(0x42C41608UL))
#define bFM4_CAN0_MSGVAL_MSGVAL3                  *((volatile  uint8_t *)(0x42C41608UL))
#define bFM_CAN0_MSGVAL_MSGVAL4                   *((volatile  uint8_t *)(0x42C4160CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL4                  *((volatile  uint8_t *)(0x42C4160CUL))
#define bFM_CAN0_MSGVAL_MSGVAL5                   *((volatile  uint8_t *)(0x42C41610UL))
#define bFM4_CAN0_MSGVAL_MSGVAL5                  *((volatile  uint8_t *)(0x42C41610UL))
#define bFM_CAN0_MSGVAL_MSGVAL6                   *((volatile  uint8_t *)(0x42C41614UL))
#define bFM4_CAN0_MSGVAL_MSGVAL6                  *((volatile  uint8_t *)(0x42C41614UL))
#define bFM_CAN0_MSGVAL_MSGVAL7                   *((volatile  uint8_t *)(0x42C41618UL))
#define bFM4_CAN0_MSGVAL_MSGVAL7                  *((volatile  uint8_t *)(0x42C41618UL))
#define bFM_CAN0_MSGVAL_MSGVAL8                   *((volatile  uint8_t *)(0x42C4161CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL8                  *((volatile  uint8_t *)(0x42C4161CUL))
#define bFM_CAN0_MSGVAL_MSGVAL9                   *((volatile  uint8_t *)(0x42C41620UL))
#define bFM4_CAN0_MSGVAL_MSGVAL9                  *((volatile  uint8_t *)(0x42C41620UL))
#define bFM_CAN0_MSGVAL_MSGVAL10                  *((volatile  uint8_t *)(0x42C41624UL))
#define bFM4_CAN0_MSGVAL_MSGVAL10                 *((volatile  uint8_t *)(0x42C41624UL))
#define bFM_CAN0_MSGVAL_MSGVAL11                  *((volatile  uint8_t *)(0x42C41628UL))
#define bFM4_CAN0_MSGVAL_MSGVAL11                 *((volatile  uint8_t *)(0x42C41628UL))
#define bFM_CAN0_MSGVAL_MSGVAL12                  *((volatile  uint8_t *)(0x42C4162CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL12                 *((volatile  uint8_t *)(0x42C4162CUL))
#define bFM_CAN0_MSGVAL_MSGVAL13                  *((volatile  uint8_t *)(0x42C41630UL))
#define bFM4_CAN0_MSGVAL_MSGVAL13                 *((volatile  uint8_t *)(0x42C41630UL))
#define bFM_CAN0_MSGVAL_MSGVAL14                  *((volatile  uint8_t *)(0x42C41634UL))
#define bFM4_CAN0_MSGVAL_MSGVAL14                 *((volatile  uint8_t *)(0x42C41634UL))
#define bFM_CAN0_MSGVAL_MSGVAL15                  *((volatile  uint8_t *)(0x42C41638UL))
#define bFM4_CAN0_MSGVAL_MSGVAL15                 *((volatile  uint8_t *)(0x42C41638UL))
#define bFM_CAN0_MSGVAL_MSGVAL16                  *((volatile  uint8_t *)(0x42C4163CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL16                 *((volatile  uint8_t *)(0x42C4163CUL))
#define bFM_CAN0_MSGVAL_MSGVAL17                  *((volatile  uint8_t *)(0x42C41640UL))
#define bFM4_CAN0_MSGVAL_MSGVAL17                 *((volatile  uint8_t *)(0x42C41640UL))
#define bFM_CAN0_MSGVAL_MSGVAL18                  *((volatile  uint8_t *)(0x42C41644UL))
#define bFM4_CAN0_MSGVAL_MSGVAL18                 *((volatile  uint8_t *)(0x42C41644UL))
#define bFM_CAN0_MSGVAL_MSGVAL19                  *((volatile  uint8_t *)(0x42C41648UL))
#define bFM4_CAN0_MSGVAL_MSGVAL19                 *((volatile  uint8_t *)(0x42C41648UL))
#define bFM_CAN0_MSGVAL_MSGVAL20                  *((volatile  uint8_t *)(0x42C4164CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL20                 *((volatile  uint8_t *)(0x42C4164CUL))
#define bFM_CAN0_MSGVAL_MSGVAL21                  *((volatile  uint8_t *)(0x42C41650UL))
#define bFM4_CAN0_MSGVAL_MSGVAL21                 *((volatile  uint8_t *)(0x42C41650UL))
#define bFM_CAN0_MSGVAL_MSGVAL22                  *((volatile  uint8_t *)(0x42C41654UL))
#define bFM4_CAN0_MSGVAL_MSGVAL22                 *((volatile  uint8_t *)(0x42C41654UL))
#define bFM_CAN0_MSGVAL_MSGVAL23                  *((volatile  uint8_t *)(0x42C41658UL))
#define bFM4_CAN0_MSGVAL_MSGVAL23                 *((volatile  uint8_t *)(0x42C41658UL))
#define bFM_CAN0_MSGVAL_MSGVAL24                  *((volatile  uint8_t *)(0x42C4165CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL24                 *((volatile  uint8_t *)(0x42C4165CUL))
#define bFM_CAN0_MSGVAL_MSGVAL25                  *((volatile  uint8_t *)(0x42C41660UL))
#define bFM4_CAN0_MSGVAL_MSGVAL25                 *((volatile  uint8_t *)(0x42C41660UL))
#define bFM_CAN0_MSGVAL_MSGVAL26                  *((volatile  uint8_t *)(0x42C41664UL))
#define bFM4_CAN0_MSGVAL_MSGVAL26                 *((volatile  uint8_t *)(0x42C41664UL))
#define bFM_CAN0_MSGVAL_MSGVAL27                  *((volatile  uint8_t *)(0x42C41668UL))
#define bFM4_CAN0_MSGVAL_MSGVAL27                 *((volatile  uint8_t *)(0x42C41668UL))
#define bFM_CAN0_MSGVAL_MSGVAL28                  *((volatile  uint8_t *)(0x42C4166CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL28                 *((volatile  uint8_t *)(0x42C4166CUL))
#define bFM_CAN0_MSGVAL_MSGVAL29                  *((volatile  uint8_t *)(0x42C41670UL))
#define bFM4_CAN0_MSGVAL_MSGVAL29                 *((volatile  uint8_t *)(0x42C41670UL))
#define bFM_CAN0_MSGVAL_MSGVAL30                  *((volatile  uint8_t *)(0x42C41674UL))
#define bFM4_CAN0_MSGVAL_MSGVAL30                 *((volatile  uint8_t *)(0x42C41674UL))
#define bFM_CAN0_MSGVAL_MSGVAL31                  *((volatile  uint8_t *)(0x42C41678UL))
#define bFM4_CAN0_MSGVAL_MSGVAL31                 *((volatile  uint8_t *)(0x42C41678UL))
#define bFM_CAN0_MSGVAL_MSGVAL32                  *((volatile  uint8_t *)(0x42C4167CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL32                 *((volatile  uint8_t *)(0x42C4167CUL))

#define bFM_CAN0_NEWDT_NEWDAT1                    *((volatile  uint8_t *)(0x42C41200UL))
#define bFM4_CAN0_NEWDT_NEWDAT1                   *((volatile  uint8_t *)(0x42C41200UL))
#define bFM_CAN0_NEWDT_NEWDAT2                    *((volatile  uint8_t *)(0x42C41204UL))
#define bFM4_CAN0_NEWDT_NEWDAT2                   *((volatile  uint8_t *)(0x42C41204UL))
#define bFM_CAN0_NEWDT_NEWDAT3                    *((volatile  uint8_t *)(0x42C41208UL))
#define bFM4_CAN0_NEWDT_NEWDAT3                   *((volatile  uint8_t *)(0x42C41208UL))
#define bFM_CAN0_NEWDT_NEWDAT4                    *((volatile  uint8_t *)(0x42C4120CUL))
#define bFM4_CAN0_NEWDT_NEWDAT4                   *((volatile  uint8_t *)(0x42C4120CUL))
#define bFM_CAN0_NEWDT_NEWDAT5                    *((volatile  uint8_t *)(0x42C41210UL))
#define bFM4_CAN0_NEWDT_NEWDAT5                   *((volatile  uint8_t *)(0x42C41210UL))
#define bFM_CAN0_NEWDT_NEWDAT6                    *((volatile  uint8_t *)(0x42C41214UL))
#define bFM4_CAN0_NEWDT_NEWDAT6                   *((volatile  uint8_t *)(0x42C41214UL))
#define bFM_CAN0_NEWDT_NEWDAT7                    *((volatile  uint8_t *)(0x42C41218UL))
#define bFM4_CAN0_NEWDT_NEWDAT7                   *((volatile  uint8_t *)(0x42C41218UL))
#define bFM_CAN0_NEWDT_NEWDAT8                    *((volatile  uint8_t *)(0x42C4121CUL))
#define bFM4_CAN0_NEWDT_NEWDAT8                   *((volatile  uint8_t *)(0x42C4121CUL))
#define bFM_CAN0_NEWDT_NEWDAT9                    *((volatile  uint8_t *)(0x42C41220UL))
#define bFM4_CAN0_NEWDT_NEWDAT9                   *((volatile  uint8_t *)(0x42C41220UL))
#define bFM_CAN0_NEWDT_NEWDAT10                   *((volatile  uint8_t *)(0x42C41224UL))
#define bFM4_CAN0_NEWDT_NEWDAT10                  *((volatile  uint8_t *)(0x42C41224UL))
#define bFM_CAN0_NEWDT_NEWDAT11                   *((volatile  uint8_t *)(0x42C41228UL))
#define bFM4_CAN0_NEWDT_NEWDAT11                  *((volatile  uint8_t *)(0x42C41228UL))
#define bFM_CAN0_NEWDT_NEWDAT12                   *((volatile  uint8_t *)(0x42C4122CUL))
#define bFM4_CAN0_NEWDT_NEWDAT12                  *((volatile  uint8_t *)(0x42C4122CUL))
#define bFM_CAN0_NEWDT_NEWDAT13                   *((volatile  uint8_t *)(0x42C41230UL))
#define bFM4_CAN0_NEWDT_NEWDAT13                  *((volatile  uint8_t *)(0x42C41230UL))
#define bFM_CAN0_NEWDT_NEWDAT14                   *((volatile  uint8_t *)(0x42C41234UL))
#define bFM4_CAN0_NEWDT_NEWDAT14                  *((volatile  uint8_t *)(0x42C41234UL))
#define bFM_CAN0_NEWDT_NEWDAT15                   *((volatile  uint8_t *)(0x42C41238UL))
#define bFM4_CAN0_NEWDT_NEWDAT15                  *((volatile  uint8_t *)(0x42C41238UL))
#define bFM_CAN0_NEWDT_NEWDAT16                   *((volatile  uint8_t *)(0x42C4123CUL))
#define bFM4_CAN0_NEWDT_NEWDAT16                  *((volatile  uint8_t *)(0x42C4123CUL))
#define bFM_CAN0_NEWDT_NEWDAT17                   *((volatile  uint8_t *)(0x42C41240UL))
#define bFM4_CAN0_NEWDT_NEWDAT17                  *((volatile  uint8_t *)(0x42C41240UL))
#define bFM_CAN0_NEWDT_NEWDAT18                   *((volatile  uint8_t *)(0x42C41244UL))
#define bFM4_CAN0_NEWDT_NEWDAT18                  *((volatile  uint8_t *)(0x42C41244UL))
#define bFM_CAN0_NEWDT_NEWDAT19                   *((volatile  uint8_t *)(0x42C41248UL))
#define bFM4_CAN0_NEWDT_NEWDAT19                  *((volatile  uint8_t *)(0x42C41248UL))
#define bFM_CAN0_NEWDT_NEWDAT20                   *((volatile  uint8_t *)(0x42C4124CUL))
#define bFM4_CAN0_NEWDT_NEWDAT20                  *((volatile  uint8_t *)(0x42C4124CUL))
#define bFM_CAN0_NEWDT_NEWDAT21                   *((volatile  uint8_t *)(0x42C41250UL))
#define bFM4_CAN0_NEWDT_NEWDAT21                  *((volatile  uint8_t *)(0x42C41250UL))
#define bFM_CAN0_NEWDT_NEWDAT22                   *((volatile  uint8_t *)(0x42C41254UL))
#define bFM4_CAN0_NEWDT_NEWDAT22                  *((volatile  uint8_t *)(0x42C41254UL))
#define bFM_CAN0_NEWDT_NEWDAT23                   *((volatile  uint8_t *)(0x42C41258UL))
#define bFM4_CAN0_NEWDT_NEWDAT23                  *((volatile  uint8_t *)(0x42C41258UL))
#define bFM_CAN0_NEWDT_NEWDAT24                   *((volatile  uint8_t *)(0x42C4125CUL))
#define bFM4_CAN0_NEWDT_NEWDAT24                  *((volatile  uint8_t *)(0x42C4125CUL))
#define bFM_CAN0_NEWDT_NEWDAT25                   *((volatile  uint8_t *)(0x42C41260UL))
#define bFM4_CAN0_NEWDT_NEWDAT25                  *((volatile  uint8_t *)(0x42C41260UL))
#define bFM_CAN0_NEWDT_NEWDAT26                   *((volatile  uint8_t *)(0x42C41264UL))
#define bFM4_CAN0_NEWDT_NEWDAT26                  *((volatile  uint8_t *)(0x42C41264UL))
#define bFM_CAN0_NEWDT_NEWDAT27                   *((volatile  uint8_t *)(0x42C41268UL))
#define bFM4_CAN0_NEWDT_NEWDAT27                  *((volatile  uint8_t *)(0x42C41268UL))
#define bFM_CAN0_NEWDT_NEWDAT28                   *((volatile  uint8_t *)(0x42C4126CUL))
#define bFM4_CAN0_NEWDT_NEWDAT28                  *((volatile  uint8_t *)(0x42C4126CUL))
#define bFM_CAN0_NEWDT_NEWDAT29                   *((volatile  uint8_t *)(0x42C41270UL))
#define bFM4_CAN0_NEWDT_NEWDAT29                  *((volatile  uint8_t *)(0x42C41270UL))
#define bFM_CAN0_NEWDT_NEWDAT30                   *((volatile  uint8_t *)(0x42C41274UL))
#define bFM4_CAN0_NEWDT_NEWDAT30                  *((volatile  uint8_t *)(0x42C41274UL))
#define bFM_CAN0_NEWDT_NEWDAT31                   *((volatile  uint8_t *)(0x42C41278UL))
#define bFM4_CAN0_NEWDT_NEWDAT31                  *((volatile  uint8_t *)(0x42C41278UL))
#define bFM_CAN0_NEWDT_NEWDAT32                   *((volatile  uint8_t *)(0x42C4127CUL))
#define bFM4_CAN0_NEWDT_NEWDAT32                  *((volatile  uint8_t *)(0x42C4127CUL))

