mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2gmxh/common/s6e2gmxh.h
#define bFM_SMCIF0_IRQ_STATUS_RDFIFOOVRIRQ        *((volatile  uint16_t*)(0x42792800UL))
#define bFM4_SMCIF0_IRQ_STATUS_RDFIFOOVRIRQ       *((volatile  uint16_t*)(0x42792800UL))
#define bFM_SMCIF0_IRQ_STATUS_WRFIFOIRQ           *((volatile  uint16_t*)(0x42792804UL))
#define bFM4_SMCIF0_IRQ_STATUS_WRFIFOIRQ          *((volatile  uint16_t*)(0x42792804UL))
#define bFM_SMCIF0_IRQ_STATUS_RDFIFOIRQ           *((volatile  uint16_t*)(0x42792808UL))
#define bFM4_SMCIF0_IRQ_STATUS_RDFIFOIRQ          *((volatile  uint16_t*)(0x42792808UL))
#define bFM_SMCIF0_IRQ_STATUS_IDTEXPIRQ           *((volatile  uint16_t*)(0x4279280CUL))
#define bFM4_SMCIF0_IRQ_STATUS_IDTEXPIRQ          *((volatile  uint16_t*)(0x4279280CUL))
#define bFM_SMCIF0_IRQ_STATUS_CARDEVENTIRQ        *((volatile  uint16_t*)(0x42792810UL))
#define bFM4_SMCIF0_IRQ_STATUS_CARDEVENTIRQ       *((volatile  uint16_t*)(0x42792810UL))
#define bFM_SMCIF0_IRQ_STATUS_RXSTBIIRQ           *((volatile  uint16_t*)(0x42792814UL))
#define bFM4_SMCIF0_IRQ_STATUS_RXSTBIIRQ          *((volatile  uint16_t*)(0x42792814UL))
#define bFM_SMCIF0_IRQ_STATUS_TXEMPIRQ            *((volatile  uint16_t*)(0x42792818UL))
#define bFM4_SMCIF0_IRQ_STATUS_TXEMPIRQ           *((volatile  uint16_t*)(0x42792818UL))
#define bFM_SMCIF0_IRQ_STATUS_RXFULIRQ            *((volatile  uint16_t*)(0x4279281CUL))
#define bFM4_SMCIF0_IRQ_STATUS_RXFULIRQ           *((volatile  uint16_t*)(0x4279281CUL))

#define bFM_SMCIF0_PORTCONTROL_TRIMOD             *((volatile  uint16_t*)(0x42792100UL))
#define bFM4_SMCIF0_PORTCONTROL_TRIMOD            *((volatile  uint16_t*)(0x42792100UL))
#define bFM_SMCIF0_PORTCONTROL_IO1                *((volatile  uint16_t*)(0x42792108UL))
#define bFM4_SMCIF0_PORTCONTROL_IO1               *((volatile  uint16_t*)(0x42792108UL))
#define bFM_SMCIF0_PORTCONTROL_IO1EN              *((volatile  uint16_t*)(0x42792110UL))
#define bFM4_SMCIF0_PORTCONTROL_IO1EN             *((volatile  uint16_t*)(0x42792110UL))
#define bFM_SMCIF0_PORTCONTROL_CLKPT              *((volatile  uint16_t*)(0x42792118UL))
#define bFM4_SMCIF0_PORTCONTROL_CLKPT             *((volatile  uint16_t*)(0x42792118UL))
#define bFM_SMCIF0_PORTCONTROL_RST                *((volatile  uint16_t*)(0x4279211CUL))
#define bFM4_SMCIF0_PORTCONTROL_RST               *((volatile  uint16_t*)(0x4279211CUL))
#define bFM_SMCIF0_PORTCONTROL_VCCEN              *((volatile  uint16_t*)(0x42792120UL))
#define bFM4_SMCIF0_PORTCONTROL_VCCEN             *((volatile  uint16_t*)(0x42792120UL))
#define bFM_SMCIF0_PORTCONTROL_VPEN               *((volatile  uint16_t*)(0x42792124UL))
#define bFM4_SMCIF0_PORTCONTROL_VPEN              *((volatile  uint16_t*)(0x42792124UL))
#define bFM_SMCIF0_PORTCONTROL_CLKOUTEN           *((volatile  uint16_t*)(0x42792130UL))
#define bFM4_SMCIF0_PORTCONTROL_CLKOUTEN          *((volatile  uint16_t*)(0x42792130UL))
#define bFM_SMCIF0_PORTCONTROL_RSTOUTEN           *((volatile  uint16_t*)(0x42792134UL))
#define bFM4_SMCIF0_PORTCONTROL_RSTOUTEN          *((volatile  uint16_t*)(0x42792134UL))
#define bFM_SMCIF0_PORTCONTROL_VCCOUTEN           *((volatile  uint16_t*)(0x42792138UL))
#define bFM4_SMCIF0_PORTCONTROL_VCCOUTEN          *((volatile  uint16_t*)(0x42792138UL))
#define bFM_SMCIF0_PORTCONTROL_VPENOUTEN          *((volatile  uint16_t*)(0x4279213CUL))
#define bFM4_SMCIF0_PORTCONTROL_VPENOUTEN         *((volatile  uint16_t*)(0x4279213CUL))

#define bFM_SMCIF0_STATUS_TXEMP                   *((volatile  uint16_t*)(0x42792080UL))
#define bFM4_SMCIF0_STATUS_TXEMP                  *((volatile  uint16_t*)(0x42792080UL))
#define bFM_SMCIF0_STATUS_RXFUL                   *((volatile  uint16_t*)(0x42792084UL))
#define bFM4_SMCIF0_STATUS_RXFUL                  *((volatile  uint16_t*)(0x42792084UL))
#define bFM_SMCIF0_STATUS_RXACT                   *((volatile  uint16_t*)(0x42792088UL))
#define bFM4_SMCIF0_STATUS_RXACT                  *((volatile  uint16_t*)(0x42792088UL))
#define bFM_SMCIF0_STATUS_TXACT                   *((volatile  uint16_t*)(0x4279208CUL))
#define bFM4_SMCIF0_STATUS_TXACT                  *((volatile  uint16_t*)(0x4279208CUL))
#define bFM_SMCIF0_STATUS_CARDDETECT              *((volatile  uint16_t*)(0x42792090UL))
#define bFM4_SMCIF0_STATUS_CARDDETECT             *((volatile  uint16_t*)(0x42792090UL))
#define bFM_SMCIF0_STATUS_CARDEVENT               *((volatile  uint16_t*)(0x42792094UL))
#define bFM4_SMCIF0_STATUS_CARDEVENT              *((volatile  uint16_t*)(0x42792094UL))
#define bFM_SMCIF0_STATUS_RECOFL                  *((volatile  uint16_t*)(0x42792098UL))
#define bFM4_SMCIF0_STATUS_RECOFL                 *((volatile  uint16_t*)(0x42792098UL))
#define bFM_SMCIF0_STATUS_IDTRUN                  *((volatile  uint16_t*)(0x4279209CUL))
#define bFM4_SMCIF0_STATUS_IDTRUN                 *((volatile  uint16_t*)(0x4279209CUL))
#define bFM_SMCIF0_STATUS_RDFIFOOVR               *((volatile  uint16_t*)(0x427920A0UL))
#define bFM4_SMCIF0_STATUS_RDFIFOOVR              *((volatile  uint16_t*)(0x427920A0UL))
#define bFM_SMCIF0_STATUS_RDFIFOFUL               *((volatile  uint16_t*)(0x427920A4UL))
#define bFM4_SMCIF0_STATUS_RDFIFOFUL              *((volatile  uint16_t*)(0x427920A4UL))
#define bFM_SMCIF0_STATUS_WRFIFOEMP               *((volatile  uint16_t*)(0x427920A8UL))
#define bFM4_SMCIF0_STATUS_WRFIFOEMP              *((volatile  uint16_t*)(0x427920A8UL))
#define bFM_SMCIF0_STATUS_RXSTARTERR              *((volatile  uint16_t*)(0x427920ACUL))
#define bFM4_SMCIF0_STATUS_RXSTARTERR             *((volatile  uint16_t*)(0x427920ACUL))
#define bFM_SMCIF0_STATUS_TXRESEND                *((volatile  uint16_t*)(0x427920B0UL))
#define bFM4_SMCIF0_STATUS_TXRESEND               *((volatile  uint16_t*)(0x427920B0UL))
#define bFM_SMCIF0_STATUS_RXRESEND                *((volatile  uint16_t*)(0x427920B4UL))
#define bFM4_SMCIF0_STATUS_RXRESEND               *((volatile  uint16_t*)(0x427920B4UL))


/*******************************************************************************
* SMCIF Registers SMCIF1
*   Bitband Section
*******************************************************************************/
#define bFM_SMCIF1_BAUDRATE_LITTLESTEP            *((volatile  uint16_t*)(0x427932BCUL))
#define bFM4_SMCIF1_BAUDRATE_LITTLESTEP           *((volatile  uint16_t*)(0x427932BCUL))

#define bFM_SMCIF1_FIFO_CLEAR_MSB_READ_CLRRDFIFO  *((volatile  uint16_t*)(0x42793700UL))
#define bFM4_SMCIF1_FIFO_CLEAR_MSB_READ_CLRRDFIFO *((volatile  uint16_t*)(0x42793700UL))

